## Data cleaning

In [ ]:
# import library
import pandas as pd
import numpy as np
from datetime import datetime
import gdown

In [8]:
url="https://media.githubusercontent.com/media/RasakOlasunkanmi/Practice_datasets/refs/heads/master/hr_data.csv"
df = pd.read_csv(url)

In [9]:
df.head()

,ID,Name,Age,Email,Join Date,Salary,Department
0,1,Chinedu Okoro,29,chinedu.okoro@gmail.com,2023-01-15,"$50,000",Engineering
1,2,Ngozi Eze,34,ngozi.eze@hotmail.com,15/01/2023,55000,Engineering
2,3,Emeka Uche,NaN,emeka.uche@yahoo.com,2022-12-05,60000,Sales
3,4,Adeola Balogun,27,adeola@@gmail.com,2023/02/30,"$45,000",HR
4,5,Ifeyinwa Okafor,thirty,ifeyinwa.okafor@gmail.com,2023-03-10,48000,Marketing

In [10]:
df.shape

(100, 7)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          100 non-null    int64
 1   Name        100 non-null    object
 2   Age         99 non-null     object
 3   Email       99 non-null     object
 4   Join Date   100 non-null    object
 5   Salary      100 non-null    object
 6   Department  100 non-null    object
dtypes: int64(1), object(6)
memory usage: 5.6+ KB

In [14]:
df.describe()

               ID
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000

In [18]:
df.isnull().sum()

ID            0
Name          0
Age           1
Email         1
Join Date     0
Salary        0
Department    0
dtype: int64

## Data Cleaning

In [17]:
# let's check for duplicate
df.duplicated().sum()

np.int64(0)

**lets fix the ID first**

In [27]:
df.head()

,ID,Name,Age,Email,Join Date,Salary,Department
0,0111111101,Chinedu Okoro,29,chinedu.okoro@gmail.com,2023-01-15,"$50,000",Engineering
1,0111111102,Ngozi Eze,34,ngozi.eze@hotmail.com,15/01/2023,55000,Engineering
2,0111111103,Emeka Uche,NaN,emeka.uche@yahoo.com,2022-12-05,60000,Sales
3,0111111104,Adeola Balogun,27,adeola@@gmail.com,2023/02/30,"$45,000",HR
4,0111111105,Ifeyinwa Okafor,thirty,ifeyinwa.okafor@gmail.com,2023-03-10,48000,Marketing

Trim off Extra spaces

In [30]:
trim_col =['Name','Email','Dapartment']
for col in trim_col:
    if col in df.columns:
        df[col] = df[col].astype(str).str.strip()


df.head()

,ID,Name,Age,Email,Join Date,Salary,Department
0,0111111101,Chinedu Okoro,29,chinedu.okoro@gmail.com,2023-01-15,"$50,000",Engineering
1,0111111102,Ngozi Eze,34,ngozi.eze@hotmail.com,15/01/2023,55000,Engineering
2,0111111103,Emeka Uche,NaN,emeka.uche@yahoo.com,2022-12-05,60000,Sales
3,0111111104,Adeola Balogun,27,adeola@@gmail.com,2023/02/30,"$45,000",HR
4,0111111105,Ifeyinwa Okafor,thirty,ifeyinwa.okafor@gmail.com,2023-03-10,48000,Marketing

**Standardized Date joined**

In [32]:
df['Join Date']=pd.to_datetime(df['Join Date'], errors='coerce',yearfirst=False) 
df.head()

,ID,Name,Age,Email,Join Date,Salary,Department
0,0111111101,Chinedu Okoro,29,chinedu.okoro@gmail.com,2023-01-15,"$50,000",Engineering
1,0111111102,Ngozi Eze,34,ngozi.eze@hotmail.com,NaT,55000,Engineering
2,0111111103,Emeka Uche,NaN,emeka.uche@yahoo.com,2022-12-05,60000,Sales
3,0111111104,Adeola Balogun,27,adeola@@gmail.com,NaT,"$45,000",HR
4,0111111105,Ifeyinwa Okafor,thirty,ifeyinwa.okafor@gmail.com,2023-03-10,48000,Marketing